Задание 04

Написать программу, порождающую дочерний процесс и  использующую однонаправленный обмен данными. 
Процесс-потомок  генерирует случайные числа и отправляет родителю. Родитель выводит числа  на экран и в файл. 
Количество чисел задается в параметрах запуска  приложения.

При запуске необходимо в парметрах запуска указать число - кол-во случайных чисел, которые сгенерирует дочерний процесс и отправит в канал.
Родительский процесс считывает эти числа из канала и выводит их на экран, и записывает в файл numbers в двоичном формате (по умолчанию)
если использовать fprintf(), FILE *file_name (сторки закоментированны), то запись будет производиться в человекочитаемом виде